name: "bge"
backend: "python"
max_batch_size: 2

input [
  {
    name: "text_input"
    data_type: TYPE_STRING
    dims: [1]
  }
]
output [
  {
    name: "embeddings"
    data_type: TYPE_FP32
    dims: [-1, -1, 1024]
  }
]
